// Напишите программу, которая на вход принимает число и выдает его квадрат.
// Например:
// 4->16
// -3->9
// -7->49
// 1. Принять числа?
// 2. Посчитать квадрат числа.
// 3. Вывести получившийся результат

// Console.WriteLine("Введите число");
// string input = Console.ReadLine();
// int number = Convert.ToInt32(input);
// int result = number * number;
// Console.WriteLine(result);

Console.WriteLine("Введите число");
int number1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(number1 * number1);